# ProjectName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ProjectName Property
ParameterTypeId Class See Also
---
"Project Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ProjectName { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ProjectName As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ProjectName {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace